Revit 2024 API
ExporterIFCUtils.GetMinSymbolWidth Method
 Obtains the minimum width of the given FamilySymbol.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static double GetMinSymbolWidth(
	FamilySymbol symbol
)
Visual Basic
Public Shared Function GetMinSymbolWidth ( _
	symbol As FamilySymbol _
) As Double
Visual C++
public:
static double GetMinSymbolWidth(
	FamilySymbol^ symbol
)
Parameters
symbol
Type: Autodesk.Revit.DB.FamilySymbol
 The family symbol.
Return Value
 The minimum width.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace